Conf.Simple/src/InformationRegisters/SUI_ОчередьЗаданий/SUI_ОчередьЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ОчередьЗаданий</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.SUI_СтатусыОбработкиОчередиЗаданий</types>
    </type>
  </resources>
  <resources>
    <name>Обработчики</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЗадания</name>
    <comment>Идентификатор фонового задания</comment>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ОбработчикЗавершения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВнеОчереди</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Создано</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Обновлено</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сеанс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписаниеРезультата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданоМеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбновленоМеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Хеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_СтатусыОбработкиОчередиЗаданий/SUI_СтатусыОбработкиОчередиЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СтатусыОбработкиОчередиЗаданий</name>
  <enumValues>
    <name>Открыто</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>Закрыто</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_КлючиРегламентыхЗаданий/SUI_КлючиРегламентыхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_КлючиРегламентыхЗаданий</name>
  <enumValues>
    <name>ОбработкаОчередиЗаданий</name>
  </enumValues>
  <enumValues>
    <name>ОчисткаЛогированияHTTPЗапросов</name>
  </enumValues>
  <enumValues>
    <name>ОчисткаОбработанныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ОчисткаОчередиЗаданий</name>
  </enumValues>
  <enumValues>
    <name>ОчисткаСообщенийМобильныхУстройств</name>
  </enumValues>
  <enumValues>
    <name>Удалить_ФормированиеСлужебныхПакетов</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаСообщенийОбменаДанными</name>
  </enumValues>
  <enumValues>
    <name>СверткаСообщенийОбменаДанными</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/InformationRegisters/SUI_ОчередьЗаданий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создать задание.
// 
// Параметры:
//  ПараметрыЗадания - Структура - Параметры задания см. SUI_ОчередьЗаданийКлиентСервер.ПараметрыСозданияЗадания
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Идентификатор созданного задния очереди
Функция СоздатьЗадание(ПараметрыЗадания) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ТипЗнч(ПараметрыЗадания.Обработчики) = Тип("Массив") И ПараметрыЗадания.Обработчики.Количество() > 0,
		НСтр("ru = 'Отсутствуют обработчики задания очереди'"),
		"РегистрыСведений.SUI_ОчередьЗаданий.СоздатьЗадание");
	
	Для индекс = 0 По ПараметрыЗадания.Обработчики.ВГраница() Цикл
		
		ОбщегоНазначенияКлиентСервер.Проверить(
			(ТипЗнч(ПараметрыЗадания.Обработчики[индекс].ИмяМетода) = Тип("Строка") И 
			Не ПустаяСтрока(ПараметрыЗадания.Обработчики[индекс].ИмяМетода)),
			НСтр("ru = 'Не заполнено имя метода обработчика задания очереди'"),
			"РегистрыСведений.SUI_ОчередьЗаданий.СоздатьЗадание");
		
		Если ПараметрыЗадания.Обработчики[индекс].Параметры <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.Проверить(
				(ТипЗнч(ПараметрыЗадания.Обработчики[индекс].Параметры) = Тип("Массив") И 
				ПараметрыЗадания.Обработчики[индекс].Параметры.Количество() > 0),
				СтрШаблон(НСтр("ru = 'Не заполнены параметры метода ""%1"" обработчика задания очереди'"), ПараметрыЗадания.Обработчики[индекс].ИмяМетода),
				"РегистрыСведений.SUI_ОчередьЗаданий.СоздатьЗадание");
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ПараметрыЗадания.ПроцедураЗавершения) Тогда
		
		ОбработчикЗавершения = SUI_ОчередьЗаданийКлиентСервер.СтруктураОбработчикаЗадания();
		ОбработчикЗавершения.ИмяМетода = ПараметрыЗадания.ПроцедураЗавершения;
		ОбработчикЗавершения.Параметры = ПараметрыЗадания.ПараметрыПроцедурыЗавершения;
		
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Идентификатор 			= Новый УникальныйИдентификатор();
	МенеджерЗаписи.Хеш 						= РасчитатьХеш(ПараметрыЗадания.Обработчики, ОбработчикЗавершения);
	МенеджерЗаписи.Наименование 			= ПараметрыЗадания.Наименование; 
	МенеджерЗаписи.Обработчики 				= Новый ХранилищеЗначения(ПараметрыЗадания.Обработчики, Новый СжатиеДанных(9));
	МенеджерЗаписи.ОбработчикЗавершения 	= Новый ХранилищеЗначения(ОбработчикЗавершения, Новый СжатиеДанных(9));
	МенеджерЗаписи.ВнеОчереди 				= ПараметрыЗадания.ВнеОчереди;
	МенеджерЗаписи.ИдентификаторДокумента	= ПараметрыЗадания.ИдентификаторДокумента;
	МенеджерЗаписи.Статус 					= Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Открыто;
	МенеджерЗаписи.Создано 					= ТекущаяДатаСеанса();
	МенеджерЗаписи.СозданоМеткаВремени 		= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	МенеджерЗаписи.Записать(Истина);
	
	Если МенеджерЗаписи.ВнеОчереди Тогда
		
		ПараметрыПроцедуры = SUI_РегламентныеЗаданияКлиентСервер.ПараметрыЗапускаРегламентногоЗадания(
			Перечисления.SUI_КлючиРегламентыхЗаданий.ОбработкаОчередиЗаданий);
		ПараметрыПроцедуры.ИгнорироватьОшибкиВыполнения = Истина;
		SUI_РегламентныеЗадания.ЗапуститьРегламентноеЗаданиеВручную(ПараметрыПроцедуры, Неопределено);
		
	КонецЕсли;
	
	Возврат МенеджерЗаписи.Идентификатор;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОтправитьСлужебноеСообщениеОтложитьТекущееЗадание() Экспорт
	
	СлужебноеСообщениеОчередиОтложитьВыполнениеЗадания().Сообщить();
	
КонецПроцедуры

Процедура НачатьОчисткуОчередиЗаданий() Экспорт
	
	ДатаНачала 			= Новый СтандартнаяДатаНачала;
	ДатаНачала.Вариант 	= ВариантСтандартнойДатыНачала.НачалоПрошлогоДня;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачальнаяДата", ДатаНачала.Дата);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ОчередьЗаданий.Идентификатор,
		|	ОчередьЗаданий.Хеш
		|ИЗ
		|	РегистрСведений.SUI_ОчередьЗаданий КАК ОчередьЗаданий
		|ГДЕ
		|	ОчередьЗаданий.Создано < &НачальнаяДата";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Пока Не РезультатЗапроса.Пустой() Цикл
		
		НачатьТранзакцию();
			
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ОчередьЗаданий");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Идентификатор", "Идентификатор");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Хеш", "Хеш");
			Блокировка.Заблокировать();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор);
				НаборЗаписей.Отбор.Хеш.Установить(Выборка.Хеш);
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			Ошибка = ИнформацияОбОшибке();
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ОчередьЗаданийКлиентСервер.ИмяСобытия(), , , , Ошибка);
			ВызватьИсключение(НСтр("ru = 'Ошибка удаления устаревших заданий очереди!'"), , , , Ошибка);
		КонецПопытки;
		
		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.Выполнить();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НачатьОбработкуОчередиЗаданий() Экспорт
	
	РезультатЗапроса = ПолучитьЗаданияКОбработкеОчереди();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоЗаданийВПотоке = ПолучитьКоличествоЗаданийВПотокеОбработки();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ЗаданияКПроверкеПослеЗапуска = Новый Массив();
	
	НомерТекущейПорции = 1;
	ПорцияЗаданий = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеЗадания = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
		
		Если Выборка.ПорядокОбхода < 0 Тогда
			ЗакрытьЗаданиеОчереди(ДанныеЗадания);
		ИначеЕсли Выборка.ПорядокОбхода < 2 Тогда
			ОбработатьЗапущенноеЗадание(ДанныеЗадания);
		Иначе
			ПорцияЗаданий.Добавить(ДанныеЗадания);
		КонецЕсли;
		
		Если ПорцияЗаданий.Количество() = КоличествоЗаданийВПотоке Тогда
			
			ЗапущенныеЗаданияОчереди = ЗапуститьПорциюЗаданийОчереди(ПорцияЗаданий, НомерТекущейПорции);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЗаданияКПроверкеПослеЗапуска, ЗапущенныеЗаданияОчереди);
			
			НомерТекущейПорции = НомерТекущейПорции + 1;
			ПорцияЗаданий = Новый Массив();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПорцияЗаданий.Количество() > 0 Тогда
		
		ЗапущенныеЗаданияОчереди = ЗапуститьПорциюЗаданийОчереди(ПорцияЗаданий, НомерТекущейПорции);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЗаданияКПроверкеПослеЗапуска, ЗапущенныеЗаданияОчереди);
		
	КонецЕсли;
	
	Для индекс = 0 По ЗаданияКПроверкеПослеЗапуска.ВГраница() Цикл
		ОбработатьЗапущенноеЗадание(ЗаданияКПроверкеПослеЗапуска[индекс]);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьЗапускПорцииЗаданийОчереди(ПорцияЗаданий, АдресРезультата) Экспорт
	
	РезультатВыполненияПорции = Новый Структура();
	РезультатВыполненияПорции.Вставить("ЗапущенныеЗадания", Новый Массив());
	
	Для индекс = 0 По ПорцияЗаданий.ВГраница() Цикл
		
		НаименованиеОперации = СтрШаблон(НСтр("ru = 'Simple: %1'"), ПорцияЗаданий[индекс].Наименование);
		
		ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне();
		ПараметрыВыполненияВФоне.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор());
		ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = НаименованиеОперации;
		
		Результат = ДлительныеОперации.ВыполнитьВФоне(
			"РегистрыСведений.SUI_ОчередьЗаданий.ЗапуститьЗаданиеОчередиЗаданий", 
			ПорцияЗаданий[индекс], ПараметрыВыполненияВФоне);
		
		ОбработатьРезультатЗапускаЗадания(ПорцияЗаданий[индекс], Результат, Результат.Сообщения);
		
		Если ПорцияЗаданий[индекс].Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется Тогда
			РезультатВыполненияПорции.ЗапущенныеЗадания.Добавить(ПорцияЗаданий[индекс]);
		КонецЕсли;
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(РезультатВыполненияПорции, АдресРезультата);
	
КонецПроцедуры

Процедура ЗапуститьЗаданиеОчередиЗаданий(ДанныеЗадания, АдресРезультата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Обработчики = ДанныеЗадания.Обработчики.Получить();
	
	Для Индекс = 0 По Обработчики.ВГраница() Цикл
		
		Попытка
			ОбщегоНазначения.ВыполнитьМетодКонфигурации(
				Обработчики[Индекс].ИмяМетода, Обработчики[Индекс].Параметры);
		Исключение
			Ошибка = ИнформацияОбОшибке();
			ТекстОшибки = НСтр("ru = 'Ошибка выполнения метода ""%1"" задания очереди!'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, Обработчики[Индекс].ИмяМетода);
			ВызватьИсключение(ТекстОшибки, , , , Ошибка);
		КонецПопытки;
		
		СообщенияПользователю = ПолучитьСообщенияПользователю(Ложь);
		СообщениеОтложитьВыполнениеЗадания = СлужебноеСообщениеОчередиОтложитьВыполнениеЗадания();
		
		Если ПроверитьНаличиеСлужебногоСообщения(СообщенияПользователю, СообщениеОтложитьВыполнениеЗадания) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьОбработчикЗавершения(ПараметрыЗавершения, АдресРезультата) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Статус", ПараметрыЗавершения.РезультатЗавершения.Статус);
	Результат.Вставить("КраткоеПредставлениеОшибки", ПараметрыЗавершения.РезультатЗавершения.КраткоеПредставлениеОшибки);
	Результат.Вставить("ПодробноеПредставлениеОшибки", ПараметрыЗавершения.РезультатЗавершения.ПодробноеПредставлениеОшибки);
	
	ДополнительныеПараметрыМетода = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыЗавершения, "ОбработчикЗавершения.Параметры");
	
	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(Результат);
	ПараметрыМетода.Добавить(ДополнительныеПараметрыМетода);
	
	Попытка
		ОбщегоНазначения.ВыполнитьМетодКонфигурации(ПараметрыЗавершения.ОбработчикЗавершения.ИмяМетода, ПараметрыМетода);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТекстОшибки = НСтр("ru = 'Ошибка выполнения метода ""%1"" обработчика завершения задания очереди!'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ПараметрыЗавершения.ОбработчикЗавершения.ИмяМетода);
		ТекстОшибкиЖР = СтрШаблон("%1
		|%2", ТекстОшибки, ОбработкаОшибок.ПодробноеПредставлениеОшибки(Ошибка));
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ОчередьЗаданийКлиентСервер.ИмяСобытия(), , , , ТекстОшибкиЖР);
		ВызватьИсключение(ТекстОшибки, , , , Ошибка);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РасчитатьХеш(Обработчики, ОбработчикЗавершения)
	
	ДанныеКРасчету = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(Обработчики, ОбработчикЗавершения);
	Возврат НРег(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ДанныеКРасчету));
	
КонецФункции

Функция СформироватьСлужебноеСообщениеОчереди(Ключ, Сообщение = "")
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.ИдентификаторНазначения = Новый УникальныйИдентификатор("1deebda3-c484-4e49-8ca6-01c184d1bab8");
	Сообщение.Поле = СтрШаблон("SimpleСлужебноеСообщение_%1", Ключ);
	Сообщение.Текст = Сообщение;
	
	Возврат Сообщение;
	
КонецФункции

Функция СлужебноеСообщениеОчередиОтложитьВыполнениеЗадания()
	
	Возврат СформироватьСлужебноеСообщениеОчереди("ОтложитьВыполнениеЗадания", НСтр("ru = 'Выполнение задания отложено.'"));
	
КонецФункции

Функция ПроверитьНаличиеСлужебногоСообщения(Сообщения, СлужебноеСообщение)
	
	Результат = Ложь;
	
	Для Каждого Сообщение Из Сообщения Цикл
		
		Если Сообщение.ИдентификаторНазначения = СлужебноеСообщение.ИдентификаторНазначения И
			Сообщение.Поле = СлужебноеСообщение.Поле Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКоличествоЗаданийВПотокеОбработки()
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		КоличествоЗаданийВПотоке = 1;
	Иначе
		КоличествоЗаданийВПотоке = Константы.SUI_КоличествоЗаданийВПотокеОчередиЗаданий.Получить();
		КоличествоЗаданийВПотоке = ?(КоличествоЗаданийВПотоке = 0, 1, КоличествоЗаданийВПотоке);
	КонецЕсли;
	
	Возврат КоличествоЗаданийВПотоке;
	
КонецФункции

Функция ПолучитьЗаданияКОбработкеОчереди()
	
	СтатусыКОбработкеОчереди = SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(
		Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется,
		Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Открыто);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	Запрос.УстановитьПараметр("Статусы", СтатусыКОбработкеОчереди);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_ОчередьЗаданий.Идентификатор КАК Идентификатор,
		|	SUI_ОчередьЗаданий.Хеш КАК Хеш,
		|	SUI_ОчередьЗаданий.Наименование КАК Наименование,
		|	SUI_ОчередьЗаданий.Статус КАК Статус,
		|	ВЫБОР
		|		КОГДА SUI_ОчередьЗаданий.ОбновленоМеткаВремени > 0
		|			ТОГДА SUI_ОчередьЗаданий.ОбновленоМеткаВремени
		|		ИНАЧЕ SUI_ОчередьЗаданий.СозданоМеткаВремени
		|	КОНЕЦ КАК МеткаВремени,
		|	ВЫБОР
		|		КОГДА SUI_ОчередьЗаданий.ИдентификаторЗадания <> &ПустойУникальныйИдентификатор
		|		И SUI_ОчередьЗаданий.Статус = ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется)
		|			ТОГДА ВЫБОР
		|				КОГДА SUI_ОчередьЗаданий.ВнеОчереди
		|					ТОГДА 0
		|				ИНАЧЕ 1
		|			КОНЕЦ
		|		КОГДА SUI_ОчередьЗаданий.Статус = ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиОчередиЗаданий.Открыто)
		|			ТОГДА ВЫБОР
		|				КОГДА SUI_ОчередьЗаданий.ВнеОчереди
		|					ТОГДА 2
		|				ИНАЧЕ 3
		|			КОНЕЦ
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК ПорядокОбхода,
		|	SUI_ОчередьЗаданий.ИдентификаторЗадания КАК ИдентификаторЗадания,
		|	SUI_ОчередьЗаданий.Обработчики КАК Обработчики,
		|	SUI_ОчередьЗаданий.ОбработчикЗавершения КАК ОбработчикЗавершения
		|ПОМЕСТИТЬ втЗадания
		|ИЗ
		|	РегистрСведений.SUI_ОчередьЗаданий КАК SUI_ОчередьЗаданий
		|ГДЕ
		|	SUI_ОчередьЗаданий.Статус В (&Статусы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗадания.Идентификатор КАК Идентификатор,
		|	втЗадания.Хеш КАК Хеш,
		|	втЗадания.Наименование КАК Наименование,
		|	втЗадания.ПорядокОбхода КАК ПорядокОбхода,
		|	втЗадания.ИдентификаторЗадания КАК ИдентификаторЗадания,
		|	втЗадания.Статус КАК Статус,
		|	втЗадания.ОбработчикЗавершения КАК ОбработчикЗавершения,
		|	втЗадания.МеткаВремени КАК МеткаВремени
		|ПОМЕСТИТЬ втЗаданияВРаботе
		|ИЗ
		|	втЗадания КАК втЗадания
		|ГДЕ
		|	втЗадания.ПорядокОбхода В (0, 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаданияКОбработке.Хеш КАК Хеш,
		|	ЗаданияКОбработке.ПорядокОбхода КАК ПорядокОбхода,
		|	МИНИМУМ(втЗадания.МеткаВремени) КАК МеткаВремени
		|ПОМЕСТИТЬ втЗаданияКОбработке
		|ИЗ
		|	(ВЫБРАТЬ
		|		втЗадания.Хеш КАК Хеш,
		|		МИНИМУМ(втЗадания.ПорядокОбхода) КАК ПорядокОбхода
		|	ИЗ
		|		втЗадания КАК втЗадания
		|	ГДЕ
		|		втЗадания.ПорядокОбхода <> -1
		|		И НЕ втЗадания.Хеш В
		|			(ВЫБРАТЬ
		|				втЗаданияВРаботе.Хеш
		|			ИЗ
		|				втЗаданияВРаботе)
		|	СГРУППИРОВАТЬ ПО
		|		втЗадания.Хеш) КАК ЗаданияКОбработке
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадания КАК втЗадания
		|		ПО ЗаданияКОбработке.Хеш = втЗадания.Хеш
		|		И ЗаданияКОбработке.ПорядокОбхода = втЗадания.ПорядокОбхода
		|СГРУППИРОВАТЬ ПО
		|	ЗаданияКОбработке.Хеш,
		|	ЗаданияКОбработке.ПорядокОбхода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗаданияВРаботе.Идентификатор КАК Идентификатор,
		|	втЗаданияВРаботе.Хеш КАК Хеш,
		|	втЗаданияВРаботе.Наименование КАК Наименование,
		|	втЗаданияВРаботе.ПорядокОбхода КАК ПорядокОбхода,
		|	втЗаданияВРаботе.ИдентификаторЗадания КАК ИдентификаторЗадания,
		|	втЗаданияВРаботе.Статус КАК Статус,
		|	НЕОПРЕДЕЛЕНО КАК Обработчики,
		|	втЗаданияВРаботе.ОбработчикЗавершения КАК ОбработчикЗавершения,
		|	втЗаданияВРаботе.МеткаВремени КАК МеткаВремени
		|ИЗ
		|	втЗаданияВРаботе КАК втЗаданияВРаботе
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втЗадания.Идентификатор,
		|	втЗадания.Хеш,
		|	втЗадания.Наименование,
		|	ЕСТЬNULL(втЗаданияКОбработке.ПорядокОбхода, -1),
		|	&ПустойУникальныйИдентификатор,
		|	втЗадания.Статус,
		|	втЗадания.Обработчики,
		|	втЗадания.ОбработчикЗавершения,
		|	втЗадания.МеткаВремени
		|ИЗ
		|	втЗадания КАК втЗадания
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЗаданияКОбработке КАК втЗаданияКОбработке
		|		ПО втЗадания.Хеш = втЗаданияКОбработке.Хеш
		|		И втЗадания.ПорядокОбхода = втЗаданияКОбработке.ПорядокОбхода
		|		И втЗадания.МеткаВремени = втЗаданияКОбработке.МеткаВремени
		|
		|ГДЕ
		|	НЕ втЗадания.ПорядокОбхода В (0, 1)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокОбхода,
		|	МеткаВремени";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ОбновитьЗаписьОчередиЗаданий(Идентификатор, Хеш, ОбновляемыеДанные)
	
	ДанныеКОбновлению = Новый Структура();
	
	Если ОбновляемыеДанные.Свойство("Статус") Тогда
		ДанныеКОбновлению.Вставить("Статус", ОбновляемыеДанные.Статус);
	КонецЕсли;
	
	Если ОбновляемыеДанные.Свойство("ИдентификаторЗадания") Тогда
		ДанныеКОбновлению.Вставить("ИдентификаторЗадания", ОбновляемыеДанные.ИдентификаторЗадания);
	КонецЕсли;
	
	Если ОбновляемыеДанные.Свойство("ОписаниеРезультата") Тогда
		ДанныеКОбновлению.Вставить("КраткоеОписаниеРезультата", ОбновляемыеДанные.ОписаниеРезультата);
	КонецЕсли;
	
	Если ОбновляемыеДанные.Свойство("ИнформацияОбОшибке") Тогда
		ДанныеКОбновлению.Вставить("КраткоеОписаниеРезультата", 
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ОбновляемыеДанные.ИнформацияОбОшибке));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(ДанныеКОбновлению.Количество() > 0,
		НСтр("ru = 'Отсутствуют данные для обновления'"),
		"РегистрыСведений.SUI_ОчередьЗаданий.ОбновитьЗаписьОчередиЗаданий");
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = Идентификатор;
	МенеджерЗаписи.Хеш = Хеш;
	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		
		Если ДанныеКОбновлению.Свойство("Статус") И
			(ДанныеКОбновлению.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполнено Или
			ДанныеКОбновлению.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки) Тогда
			
			ДанныеОбработчикаЗавершения = Новый Структура("Статус, ИнформацияОбОшибке");
			ДанныеКОбновлению.Свойство("Статус", ДанныеОбработчикаЗавершения.Статус);
			ОбновляемыеДанные.Свойство("ИнформацияОбОшибке", ДанныеОбработчикаЗавершения.ИнформацияОбОшибке);
			
		Иначе
			ДанныеОбработчикаЗавершения = Неопределено;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеКОбновлению);
		
		МенеджерЗаписи.Сеанс = НомерСеансаИнформационнойБазы();
		МенеджерЗаписи.Обновлено = ТекущаяДатаСеанса();
		МенеджерЗаписи.ОбновленоМеткаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		Попытка
			МенеджерЗаписи.Записать(Истина);
		Исключение
			Ошибка = ИнформацияОбОшибке();
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ОчередьЗаданийКлиентСервер.ИмяСобытия(), , , , Ошибка);
			ВызватьИсключение(НСтр("ru = 'Ошибка обновления записи задания очереди!'"), , , , Ошибка);
		КонецПопытки;
		
		Если ДанныеОбработчикаЗавершения <> Неопределено Тогда
			ЗапуститьОбработчикЗавершения(МенеджерЗаписи.ОбработчикЗавершения.Получить(), ДанныеОбработчикаЗавершения);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МенеджерЗаписи.Идентификатор;
	
КонецФункции

Функция ЗапуститьПорциюЗаданийОчереди(ПорцияЗаданий, НомерПорции)
	
	ЗапущенныеЗадания = Новый Массив();
	
	Если ПорцияЗаданий.Количество() > 0 Тогда
		
		НаименованиеОперации = НСтр("ru = 'Simple: Обработка очереди заданий %1'");
		НаименованиеОперации = СтрШаблон(НаименованиеОперации, Формат(НомерПорции, "ЧН=-; ЧГ=0;"));
		
		ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне();
		ПараметрыВыполненияВФоне.ОжидатьЗавершение = Неопределено;
		ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = НаименованиеОперации;
		ПараметрыВыполненияВФоне.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор());
		
		Если ПорцияЗаданий.Количество() = 1 Тогда
			ПараметрыВыполненияВФоне.ЗапуститьНеВФоне = Истина;
		КонецЕсли;
		
		Результат = ДлительныеОперации.ВыполнитьВФоне(
			"РегистрыСведений.SUI_ОчередьЗаданий.ОбработатьЗапускПорцииЗаданийОчереди", 
			ПорцияЗаданий, ПараметрыВыполненияВФоне);
		
		Если Результат.Статус = "Выполнено" Тогда
			
			РезультатВыполненияПорции = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			ЗапущенныеЗадания = РезультатВыполненияПорции.ЗапущенныеЗадания;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗапущенныеЗадания;
	
КонецФункции

Процедура ЗакрытьЗаданиеОчереди(ДанныеЗадания)
	
	ДанныеКОбновлению = Новый Структура();
	ДанныеКОбновлению.Вставить("Статус", Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Закрыто);
	
	Если ДанныеЗадания.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется И
		ДанныеЗадания.ИдентификаторЗадания = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор() Тогда
		ДанныеКОбновлению.Вставить("ОписаниеРезультата",
			НСтр("ru = 'Задание закрыто по причине: Не заполнен идентификатор фонового задания!'"));
	КонецЕсли;
	
	ОбновитьЗаписьОчередиЗаданий(ДанныеЗадания.Идентификатор, ДанныеЗадания.Хеш, ДанныеКОбновлению);
	
КонецПроцедуры

Процедура ОбработатьЗапущенноеЗадание(ДанныеЗадания)
	
	Если Не ЗначениеЗаполнено(ДанныеЗадания.ИдентификаторЗадания) Тогда
		ЗакрытьЗаданиеОчереди(ДанныеЗадания);
	Иначе
		
		РезультатЗадания = ДлительныеОперации.ЗаданиеВыполнено(ДанныеЗадания.ИдентификаторЗадания, Истина);
		СообщенияИзЗадания = ДлительныеОперации.СообщенияПользователю(Ложь, РезультатЗадания.ИдентификаторЗадания);
		
		ОбработатьРезультатЗапускаЗадания(ДанныеЗадания, РезультатЗадания, СообщенияИзЗадания);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьРезультатЗапускаЗадания(ДанныеЗадания, РезультатЗапуска, СообщенияИзЗадания)
	
	ДанныеКОбновлению = Новый Структура();
	ДанныеКОбновлению.Вставить("ИдентификаторЗадания");
	
	Если РезультатЗапуска.Статус = "Выполнено" Тогда
		
		ДанныеКОбновлению.Вставить("Статус", Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполнено);
		ДанныеКОбновлению.Вставить("ОписаниеРезультата", НСтр("ru = 'Задание выполнено.'"));
		
		СообщениеОтложитьВыполнениеЗадания = СлужебноеСообщениеОчередиОтложитьВыполнениеЗадания();
		
		Если ПроверитьНаличиеСлужебногоСообщения(СообщенияИзЗадания, СообщениеОтложитьВыполнениеЗадания) Тогда
			ДанныеКОбновлению.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Открыто;
			ДанныеКОбновлению.ОписаниеРезультата = НСтр("ru = 'Выполнение задания отложено.'");
		КонецЕсли;
		
	ИначеЕсли РезультатЗапуска.Статус = "Ошибка" Тогда
		
		ДанныеКОбновлению.Вставить("Статус", Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки);
		ДанныеКОбновлению.Вставить("ИнформацияОбОшибке", РезультатЗапуска.ИнформацияОбОшибке);
		
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ОчередьЗаданийКлиентСервер.ИмяСобытия(), , , , 
			РезультатЗапуска.ИнформацияОбОшибке);
		
	ИначеЕсли РезультатЗапуска.Статус = "Отменено" Тогда
		
		ДанныеКОбновлению.Вставить("Статус", Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки);
		ДанныеКОбновлению.Вставить("ОписаниеРезультата", НСтр("ru = 'Выполнение задания было отменено пользователем.'"));
		
	Иначе
		
		ДанныеКОбновлению.Вставить("Статус", Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется);
		ДанныеКОбновлению.ИдентификаторЗадания = РезультатЗапуска.ИдентификаторЗадания;
		
		ДанныеЗадания.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется;
		ДанныеЗадания.ИдентификаторЗадания = РезультатЗапуска.ИдентификаторЗадания;
		
	КонецЕсли;
	
	ОбновитьЗаписьОчередиЗаданий(ДанныеЗадания.Идентификатор, ДанныеЗадания.Хеш, ДанныеКОбновлению);
	
КонецПроцедуры

Процедура ЗапуститьОбработчикЗавершения(ОбработчикЗавершения, Данные)
	
	ИмяМетодаОбработчикаЗавершения = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ОбработчикЗавершения, "ИмяМетода", "", Тип("Строка"));
	
	Если ПустаяСтрока(ИмяМетодаОбработчикаЗавершения) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗавершения = Новый Структура();
	РезультатЗавершения.Вставить("Статус");
	РезультатЗавершения.Вставить("КраткоеПредставлениеОшибки", "");
	РезультатЗавершения.Вставить("ПодробноеПредставлениеОшибки", "");
	
	Если Данные.Свойство("Статус") И Данные.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполнено Тогда
		РезультатЗавершения.Статус = "Выполнено";
	ИначеЕсли Данные.Свойство("Статус") И Данные.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки Тогда
		
		РезультатЗавершения.Статус = "Ошибка";
		
		Если Данные.Свойство("ИнформацияОбОшибке") Тогда
			РезультатЗавершения.КраткоеПредставлениеОшибки = 
				ОбработкаОшибок.КраткоеПредставлениеОшибки(Данные.ИнформацияОбОшибке);
			РезультатЗавершения.ПодробноеПредставлениеОшибки = 
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(Данные.ИнформацияОбОшибке);
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	// Процедура завершения задания
	ПараметрыПроцедурыЗавершения = Новый Структура();
	ПараметрыПроцедурыЗавершения.Вставить("ОбработчикЗавершения", ОбработчикЗавершения);
	ПараметрыПроцедурыЗавершения.Вставить("РезультатЗавершения", РезультатЗавершения);
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне();
	ПараметрыВыполненияВФоне.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор());
	
	ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.SUI_ОчередьЗаданий.ВыполнитьОбработчикЗавершения", 
		ПараметрыПроцедурыЗавершения, ПараметрыВыполненияВФоне);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
